[
  {
    "Id": "640146",
    "ThreadId": "264596",
    "Html": "\r\n<p>I don't like ClickOnce. Can you please provide a standalone MSI installer?</p>\r\n",
    "PostedDate": "2011-07-10T12:31:22.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "640711",
    "ThreadId": "264596",
    "Html": "<p>I'm curious what your concern with ClickOnce is.</p>\r\n<p>The application is prettymuch x-copy deployable but it&nbsp;keeps settings and cached files&nbsp;in your appdata directory.&nbsp; I'm not sure of anything significant that using MSI would benefit over ClickOnce.</p>\r\n<p>The main reason for using ClickOnce is it provides a solution for application updates, which is especially important since Facebook tends to unexpectedly change their API behaviors.&nbsp; When Fishbowl is run and not deployed through ClickOnce the user won't get automatic updates and the app may run with limited functionality as parts of the Facebook integration begin to fail.&nbsp; I'd rather not make it so people who don't care about whether it's installed through ClickOnce accidentally opt-out of the app updating itself by installing it a different way.</p>",
    "PostedDate": "2011-07-11T16:02:52.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "640870",
    "ThreadId": "264596",
    "Html": "<p>Thanks for replying. My concerns with ClickOnce are:<br />1.&nbsp; One cannot deploy it to multiple computers. Plus it installs on per-user basis instead of per-machine basis.<br />2.&nbsp; I have outgoing firewalls on most PCs and it blocks the installation. The firewall needs to be turned off on all of them.<br />3.&nbsp; The user cannot download/own the installer with ClickOnce as he can with MSI. Say, tommorrow for example, you drop Windows XP support and I don't have an earlier version installed, I won't be able to obtain Fishbowl for new XP&nbsp;installations any more.<br />4.&nbsp; ClickOnce hides where the application gets installed in some obscure directory in %appdata% instead of Program Files.<br />5.&nbsp; Somewhat forced updates. You are constantly nagged to update even if you don't want to.<br />You can write a standalone tiny standalone updater and it will become better than ClickOnce.</p>",
    "PostedDate": "2011-07-11T23:02:38.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "832639",
    "ThreadId": "264596",
    "Html": "<p>Yes. Need a FishBowl Offline Installer file. Online Installer file not good a solution.</p>",
    "PostedDate": "2012-05-06T00:58:26.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]